# Pandas hand's  on

In [1]:
import pandas as pd

Problem Statement:
Large datasets need to be structured and free of outliers in order to be used for further analysis
and model building in cases of supervised or unsupervised learning. Python pandas is one such
python package that deals with manipulation of data with various operations. Use the modules
and processes available in the python pandas module to come up with useful insights about the
data

# Tasks To be Performed:

1. Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
of the data types into a pandas series. Create a separate list of index values for the
series.

In [2]:
llist = [1,2,3,4,5,6,7,8,9,10]
ttuple = (1,2,3,4,5,6,7,8,9,10)
sets = {1,2,3,4,5,6,7,8,9,10}

In [3]:
x = ['a','b','c','d','e','f','g','h','i','j']
series_list = pd.Series(llist, index=x)
series_tuple = pd.Series(ttuple, index=x)
series_sets = pd.Series(list(sets), index=x)
print(series_list)
print(series_tuple)
print(series_sets)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64
a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64
a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [5]:
l_new = list(range(1,11))
t_new = tuple(range(1,11))
s_new = set(range(1,11))
l_new, t_new, s_new

([1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
 (1, 2, 3, 4, 5, 6, 7, 8, 9, 10),
 {1, 2, 3, 4, 5, 6, 7, 8, 9, 10})

In [9]:
type(s_new)

set

2. Create a python dictionary with three key value pairs. Keep the keys as the first names,
and the respective last names as values in the dictionary. Use the dictionary to create a
pandas series.

In [13]:
# Dictionary with key-value pairs
n_dict = {"Raju":"Sharma","Rahul":"Verma","Kamal":"Choudhary","Ravi":"Jain"}

# Create a pandas series
name_series = pd.Series(n_dict)

print("Serie from dictionary:", name_series)

Serie from dictionary: Raju        Sharma
Rahul        Verma
Kamal    Choudhary
Ravi          Jain
dtype: object

3. Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:
a. Convert it to a list.
b. Convert it to a dictionary.
c. Convert it to a tuple.
d. Convert it to a set.

In [12]:
# Series with numbers and index values
s = pd.Series(range(1, 11), index=list(range(0, 10)))
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [13]:
# Convert series to different data types
new_list = s.tolist()
new_dict = s.to_dict()
new_tuple = tuple(s)
new_set = set(s)

print("Series list:", new_list)
print("Series dictionary:", new_dict)
print("Series tuple:", new_tuple)
print("Series set:", new_set)

Series list: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
Series dictionary: {0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}
Series tuple: (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
Series set: {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

4. Create a sample pandas series with x integer elements. Perform the following operations
on the same:
a. Print the first 5 elements of the series
b. Print the last 5 elements of the series
c. Insert an integer value ‘50’ at the index 5.
d. Update the last element in the series with the value 100.
e. Delete the first element from the series.

Note: The index values must not be affected by the operations and should be uniform for
the series after the last operation.

In [20]:
# Sample series with integer elements
s = pd.Series(range(1, 11))
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [26]:
# Print first 5 elements
print(s.head())

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
 # Print last 5 elements
print(s.tail())

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [27]:
# Insert value at specific index
s[5] = 50

print(s)

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [32]:
# ##Update last element


# s[-1] = 100
# print(s)

s[len(s)-1] = 100
s

 0       1
 1       2
 2       3
 3       4
 4       5
 5      50
 6       7
 7       8
 8       9
 9      10
-1     100
 10    100
 11    100
dtype: int64

In [36]:
# Delete first element

#(a)
#s.drop(0, inplace=True)


print(s)

#(b)
#s = s[1:]
#print(s)

 1       2
 2       3
 3       4
 4       5
 5      50
 6       7
 7       8
 8       9
 9      10
-1     100
 10    100
 11    100
dtype: int64

In [37]:
#final Series
print(s)

 1       2
 2       3
 3       4
 4       5
 5      50
 6       7
 7       8
 8       9
 9      10
-1     100
 10    100
 11    100
dtype: int64

5. For a given pandas series obtained in the 4th step. Write a sample code to find the
element 100 in the series.

In [41]:
# Check if element exists
print("Element 100 exists:", 100 in s)

Element 100 exists: False

False

In [49]:
for i in s:
    if i == 100:
        print("True")

True
True
True

In [50]:
for i in s:
    if i == 100:
        print("True")
    else:
        print("False")

False
False
False
False
False
False
False
False
False
True
True
True

6. For the given series A and B, perform concatenation on the same.
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])

In [51]:
series_A = pd.Series([1, 2, 3, 4, 5])
series_B = pd.Series([6, 7, 8, 9, 10])

combined_series = pd.concat([series_A, series_B])
print("Combined series:",combined_series)

Combined series: 0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

7. Using loops in python, print all the elements within a pandas series.
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [53]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [54]:
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

8. For a given nested list and a sample dictionary, create two data frames using pandas.



List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]




Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [55]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

df1 = pd.DataFrame(List)
df2 = pd.DataFrame(Dictionary)

print(df1)
print(df2)

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II
     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following operations on the same.


a. Print the first 3 rows of the Data Frame .
b. Print the rows that have the age greater than 15.
c. Insert 5 imaginary names and ages as values to the pandas Data Frame .
d. Update the 5th row so that the name = john and age=56.
e. Delete the first row from the Data Frame .

In [2]:
# Create dataframe with two columns
data = {'Name': ['Rahul', 'vicky', 'Navven', 'Raj'], 'Age': [16, 12, 10, 20]}
df = pd.DataFrame(data)
(df)



# # Insert new rows
# imaginary_names = ['David', 'Emma', 'Frank', 'George', 'Hannah']
# imaginary_ages = [14, 22, 35, 28, 19]

# df = df.append(pd.DataFrame({'Name': imaginary_names, 'Age': imaginary_ages}), ignore_index=True)



# # Delete first row
# df = df.drop(index=0)

# print("Modified dataframe:")
# print(df)

     Name  Age
0   Rahul   16
1   vicky   12
2  Navven   10
3     Raj   20

In [3]:
# A. Print first 3 rows
df.head(3)

     Name  Age
0   Rahul   16
1   vicky   12
2  Navven   10

In [4]:
# Print rows with age > 15

(df[df['Age'] > 15])

    Name  Age
0  Rahul   16
3    Raj   20

In [5]:
#  Update 5th row 

df.at[4,'Name'] = 'John'
df.at[4,'Age'] = 56

In [6]:
df

     Name   Age
0   Rahul  16.0
1   vicky  12.0
2  Navven  10.0
3     Raj  20.0
4    John  56.0

In [7]:
# Delete first row

df = df.drop(0)
df

     Name   Age
1   vicky  12.0
2  Navven  10.0
3     Raj  20.0
4    John  56.0

10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary
respectively.

In [8]:
# Convert dataframe to list
data_list = df.values.tolist()

# Convert dataframe to dictionary
data_dict = df.to_dict(orient='records')

print("Data list:", data_list)
print("Data dictionary:", data_dict)

Data list: [['vicky', 12.0], ['Navven', 10.0], ['Raj', 20.0], ['John', 56.0]]
Data dictionary: [{'Name': 'vicky', 'Age': 12.0}, {'Name': 'Navven', 'Age': 10.0}, {'Name': 'Raj', 'Age': 20.0}, {'Name': 'John', 'Age': 56.0}]

11. Create two separate Data Frames A and B, and perform the following operations on them. 

a. Concatenate the two Data Frame s to a new Data Frame C. 

b. Split the Data Frame C row wise. 

c. Split the Data Frame column wise based on a condition.example - columns values greater than 10, column values less than 10, etc.

In [10]:

# print("Concatenated dataframe:", df_c)
# print("Split dataframe:", df_list)
# print("Dataframe with age > 10:", df_gt_10)
# print("Dataframe with age <= 10:", df_lt_10)

In [11]:
# create two dataframe A and B

df_a = pd.DataFrame({'Name': ['Yash', 'Max', 'Raj', 'Vicky'], 'Age': [25, 30, 20, 22]})
df_b = pd.DataFrame({'Name': ['Pinky', 'Shimi', 'Payal', 'Sonu'], 'Age': [18, 23, 35, 26]})

In [14]:
# concatenate Dataframe
df_c = pd.concat([df_a, df_b])
df_c

    Name  Age
0   Yash   25
1    Max   30
2    Raj   20
3  Vicky   22
0  Pinky   18
1  Shimi   23
2  Payal   35
3   Sonu   26

In [16]:
# # Split DataFrames row wise

df_list = df_c.to_numpy().tolist()
df_list

[['Yash', 25],
 ['Max', 30],
 ['Raj', 20],
 ['Vicky', 22],
 ['Pinky', 18],
 ['Shimi', 23],
 ['Payal', 35],
 ['Sonu', 26]]

In [17]:
# # Split DataFrames column wise

df_gt = df_c[df_c['Age'] > 10]
df_lt = df_c[df_c['Age'] <= 10]

In [19]:
print(df_gt)

    Name  Age
0   Yash   25
1    Max   30
2    Raj   20
3  Vicky   22
0  Pinky   18
1  Shimi   23
2  Payal   35
3   Sonu   26

In [20]:
print(df_lt)

Empty DataFrame
Columns: [Name, Age]
Index: []

12. Create a Data Frame with columns Name and Age. Perform the following operations. 

a. Write a sample code to search for the Name/Names where Age is 20. 

b. Sort the Data Frame in ascending order of ages. 

c. Using Python loops, print the ages from the data frame and store it in a set

In [21]:
df_c

    Name  Age
0   Yash   25
1    Max   30
2    Raj   20
3  Vicky   22
0  Pinky   18
1  Shimi   23
2  Payal   35
3   Sonu   26

In [24]:
# Search for names with age 20
search_n = df_c.loc[df_c['Age'] == 20, 'Name']
search_n

2    Raj
Name: Name, dtype: object

In [26]:
# Sort dataframe by age
sorted_df = df_c.sort_values(by=['Age'], ascending=True)
sorted_df

    Name  Age
0  Pinky   18
2    Raj   20
3  Vicky   22
1  Shimi   23
0   Yash   25
3   Sonu   26
1    Max   30
2  Payal   35

In [27]:
# Store ages in a set using loop
ages_s = set()
for i in df_c['Age']:
    ages_s.add(i)

In [29]:
print(ages_s)

{35, 18, 20, 22, 23, 25, 26, 30}